Itop agency, Junior Front-end Developer (React/Angular), https://jobs.dou.ua/companies/itop1000/vacancies/185572/?from=widget_company


Реализовать секундомер, который подсчитывает время в формате «HH: MM: SS»

Секундомер должен иметь следующие кнопки:

* «Start / Stop» - запуск / остановка отсчета времени, останавливает и обнуляет значение таймера.

* «Wait» - работает на двойной клик (время между нажатиями не более 300 мс!) таймер должен прекратить отсчет времени; если после него нажать старт, то возобновляется отсчет.

* «Reset» - сброс секундомера  на 0.  Обнуляет секундомер и снова начинает отсчет.

Требования:

 - используйте Observables в коде

 - RxJS подход

 - функциональный подход

 - нам важнее всего увидеть Ваше умение писать код

- 300 млс – это не DoubleClick
Такі питання: чи треба для роботи з observables використовувати якусь бібліотеку, чи це вже є в реакт?
Зберігати час як об’єкт в стейті? Чи правильно розумію що треба підключити lodash throattle?
